src/cf/DataProcessors/ЗагрузкаИзCSV.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаИзCSV</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаИзCSV/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ДиалогВыборФайла = Новый ДиалогВыборФайла(РежимДиалогаВыборФайла.Открытие);
	
	ДиалогВыборФайла.Фильтр = НСтр("ru='CSV файл (*.csv)|*.csv'");
	ДиалогВыборФайла.Заголовок = НСтр("ru='Выберите CSV файл'");
	ДиалогВыборФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыборФайла.Расширение = "csv";
	ДиалогВыборФайла.ИндексФильтра = 0;
	ДиалогВыборФайла.ПолноеИмяФайла = ПутьКФайлу;
	ДиалогВыборФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	Док = Новый ТекстовыйДокумент();
	Док.Прочитать(ПутьКФайлу);
	
	Для А = 1 По Док.КоличествоСтрок() Цикл
		Строка = Док.ПолучитьСтроку(А);
		Массив = СтрРазделить(Строка, ";");
		ВидНоменклатуры = Массив[1];
		Наименование = Массив[0];
		Группа = Массив[2];
		
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
		НоваяНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоНаименованию(Группа);
		НоваяНоменклатура.Наименование = Наименование;   
		Если ВидНоменклатуры = "Товар" Тогда
			НоваяНоменклатура.ВидНоменклатуры  = Перечисления.ВидыНоменклатуры.Товар;
		Иначе          
			НоваяНоменклатура.ВидНоменклатуры  = Перечисления.ВидыНоменклатуры.Услуга;
		КонецЕсли;
		НоваяНоменклатура.Записать();
			
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
